2024/Fichiers_tex/rapport-2024-08-23.tex
% Created 2024-10-09 Wed 20:04
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{article}
% =================================BASE====================================%
\usepackage[left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry} % Marges
\usepackage[T1]{fontenc} % Nécessaire avec FrenchBabel
\usepackage[utf8]{inputenc} % Important pour symboles Francophones, é,à,etc
\usepackage{csquotes} % Recommandé par PDFLatex lors de la compilation. 

% Calligraphie
%\usepackage{pxfonts} % Met le texte ET les maths en Palatino + donne accès à des symboles math
%\usepackage{palatino} % Cette commande met seulement le texte en police palatino
\usepackage{lmodern} % Pour les maths? Lmodern pour les maths
\usepackage{cfr-lm}
% Use lmodern for sans-serif
\usepackage{mathrsfs} % Permet la command \mathscr (Lettres attachées genre) \mathscr(ABC)
\usepackage{eucal}   % Vient changer le \mathcal{ABC} parce que celui de base est laid.

% Bibliographie
\usepackage[backend=biber,style=alphabetic,sorting=ynt,maxbibnames=99]{biblatex}
%\usepackage[backend=biber,sorting=ynt,style=authoryear]{biblatex} % Ça semble tout changer.
\addbibresource{master-bibliography.bib}


\usepackage{amsmath, amssymb, amsthm} % Symb. math. (Mathmode+Textmode) + Beaux théorèmes.
\usepackage{mathtools,cancel,xfrac} % Utilisation de boîtes \boxed{} + \cancelto{}{}, xfrac
\usepackage{graphicx, wrapfig} % Géstion des figures.
\usepackage{hyperref} % Permettre l'utilisation d'hyperliens.
\usepackage{color} % Permettre l'utilisation des couleurs.
\usepackage{colortbl} % Color tables
\usepackage[dvipsnames]{xcolor} % Couleurs avancées.

% Physique
\usepackage{physics} % Meilleur package pour physicien. 

% Style
\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usetikzlibrary{arrows.meta,bending, shapes.geometric, automata, positioning, decorations.pathreplacing} % Arrow heads et les formes de noeuds
\usepackage{empheq} % Boite autour de MULTIPLE équations
\usepackage{bbding}

% Français
\usepackage[french]{babel} % Environnements en Français.

\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate
% ==============================BASE-(END)=================================%





% ================================SETTINGS=================================%
% Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt}
\setlength{\parskip}{0.15cm}

% Tableaux/tabular
% Espace vertical dans les tabular/tableaux
\renewcommand{\arraystretch}{1.2}
% Couleur des tableaux/tabular
% \rowcolors{3}{violet!5}{}

% Couleurs de hyperliens :
\definecolor{mypink}{RGB}{147, 0, 255}
\hypersetup{colorlinks, 
             filecolor=mypink,
             urlcolor=mypink, 
             citecolor=mypink, 
             linkcolor=mypink, 
             anchorcolor=mypink}


% Numéros d'équations suivent les sections :
\numberwithin{equation}{section} 

% Les « captions » sont en italique et largeur limitée
\usepackage[textfont = it]{caption} 
\captionsetup[wrapfigure]{margin=0.5cm}

% Retirer l'écriture en gras dans la table des matières
\usepackage{tocloft}
\renewcommand{\cftsecfont}{\normalfont}
\renewcommand{\cftsecpagefont}{\normalfont}


% On a des lignes à droite des sections et sous-sections
\usepackage[explicit]{titlesec}
    % Raised Rule Command:
    % Arg 1 (Optional) - How high to raise the rule
    % Arg 2 - Thickness of the rule
    \newcommand{\raisedrulefill}[2][0ex]{\leaders\hbox{\rule[#1]{1pt}{#2}}\hfill}
    \titleformat{\section}{\Large\bfseries}{\thesection. }{0em}{#1\;\raisedrulefill[0.4ex]{0.25pt}}
    \titleformat{\subsection}{\large\bfseries}{\thesubsection. }{0em}{#1\;\raisedrulefill[0.4ex]{0.10pt}}


% Change bullet style
%\usepackage{pifont}
\usepackage{enumitem}
%\setlist[itemize,1]{label=\ding{224}}
%\setlist[itemize,1]{label=\ding{239}}
%\setlist[itemize,1]{label=$\cdot$}
\renewcommand{\boxtimes}{\blacksquare}
% ================================SETTINGS=================================%



% ==============================NEWCOMMANDS================================%
% CQFD symbol
\renewcommand{\qedsymbol}{$\hfill\blacksquare$}
\newcommand{\cqfd}{\hfill$\blacktriangleleft$}

% Vecteurs de base :
\newcommand{\nvf}{\vb{\hat{n}}}
\newcommand{\evf}{\vb{\hat{e}}}
\newcommand{\ivf}{\vb{\hat{i}}}
\newcommand{\jvf}{\vb{\hat{j}}}
\newcommand{\kvf}{\vb{\hat{k}}}
\newcommand{\uu}{\vb{u}}
\newcommand{\vv}{\vb{v}}
\newcommand{\ust}{\vb{u}_{\ast}}
\newcommand{\xx}{\vb{x}}
\newcommand{\rad}{\text{Rad}}

% Physics empty spaces 
\newcommand{\short}{\vphantom{pA}}
\newcommand{\tall}{\vphantom{pA^{x^x}_p}}
\newcommand{\grande}{\vphantom{\frac{1}{xx}}}
\newcommand{\venti}{\vphantom{\sum_x^x}}
\newcommand{\pt}{\hspace{1pt}} % One horizontal pt space

% Moyenne numérique entre deux points de grilles. 
\newcommand{\xmean}[1]{\overline{#1}^x}
\newcommand{\ymean}[1]{\overline{#1}^y}
\newcommand{\zmean}[1]{\overline{#1}^z}
\newcommand{\xymean}[1]{\overline{#1}^{xy}}

% Tilde over psi
\newcommand{\tpsi}{\tilde{\psi}}
\newcommand{\tphi}{\tilde{\phi}}

% Nota Bene env : (\ding{89})
%\newcommand{\nb}{$\boxed{\text{\footnotesize\EightStarConvex}\pt \mathfrak{N. B.}}$\hspace{4pt}}
\newcommand{\nb}{\underline{{\footnotesize\EightStarConvex}\pt $\mathfrak{N.B.}$\vphantom{p}}\hspace{3pt}}

\newcommand{\exemple}{
\parbox[center]{2.2cm}{\begin{tcolorbox}[sharp corners, rounded corners=northeast, rounded corners=southeast,
colback=Violet!2, colframe=black,
size=small, width=2cm, left=-0.25pt, bottom=-0.5pt,
arc is angular, arc=2.5mm, boxrule=0.35pt, leftrule=4pt, %bottomrule=1pt,
after={\enskip}] Exemple \end{tcolorbox}}}

% Define the nota bene environment
\usepackage{tcolorbox}
\newtcolorbox{notabene}{
     colback=blue!5,
     colframe=black,
     boxrule=0.5pt,
     arc=2pt,
     left=5pt,
     right=5pt,
     top=5pt,
     bottom=5pt,
}


\newcommand{\cmark}{\ding{52}}
\newcommand{\xmark}{\ding{55}}

%\newcommand{\fourier}[1]{\raisebox{-0.4em}{\resizebox{2em}{!}{$\mathscr{F}$}\,}\qty[#1]}
\newcommand{\fourier}{\operatorname{\raisebox{-0.4em}{\resizebox{2em}{!}{$\mathscr{F}$}}}}
% Mettre (a,b) à la suite d'une série d'équations horizontales.
\newcommand{\ab}{\refstepcounter{equation}\tag{\theequation a,b}}
% ==============================NEWCOMMANDS================================%



% ==============================PAGE-TITRE=================================%
% Titlepage 
\newcommand{\mytitlepage}{
\begin{titlepage}
\begin{center}
{\Huge \thesubtitle \par}
\vspace{2cm}
{\Huge \MakeUppercase{\thetitle} \par}
\vspace{2cm}
RÉALISÉ DANS LE CADRE\\ D'UN PROJET POUR \par
\vspace{2cm}
{\Huge ISMER--UQAR \par}
\vspace{2cm}
{\thedate}
\end{center}
\vfill
Rédaction \\
{\theauthor}\\
\url{charles-edouard.lizotte@uqar.ca}\\
ISMER-UQAR\\
Police d'écriture : \textbf{CMU Serif Roman}
\end{titlepage}
}
% ==============================PAGE-TITRE=================================%



% =================================ENTÊTE==================================%
\usepackage{fancyhdr}
\pagestyle{fancy}
\setlength{\headheight}{13pt}
\renewcommand{\headrulewidth}{0.0pt} % Ligne horizontale en haut

\fancyhead[R]{\underline{\textit{Section \thesubsection}}}
\fancyhead[L]{\underline{\textit{\thepage}}}
\fancyfoot[R]{\textit{\theauthor}}
\fancyfoot[L]{}
\fancyfoot[C]{} 
% =================================ENTÊTE==================================%
\author{Charles-Édouard Lizotte}
\date{23/08/2024}
\title{Rapport hebdomadaire}
\newcommand{\thesubtitle}{Contrat Été 2024}
\hypersetup{
 pdfauthor={Charles-Édouard Lizotte},
 pdftitle={Rapport hebdomadaire},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={French}}
\begin{document}

\mytitlepage
\tableofcontents\newpage
\section{Retour sur le modèle de vagues}
\label{sec:org19f8e3d}

\subsection{Valeurs positives}
\label{sec:org9f1f382}

Un gros problème tout au long du modèle était l'existence de valeurs négatives pour le spectre de vague -- ce qui ne fait aucun sens.
Pour pallier au problème, j'ai donc mis des filtres qui s'assurent d'avoir un minimum de 0 pour le spectre lorsque les termes source font descendre notre spectre trop bas.
\begin{itemize}
\item Le premier est après l'advection;
\item Le second est juste après l'ajout des termes source.
\end{itemize}
\subsection{Introduction de l'énergie dans les vagues}
\label{sec:orgff35544}

Le terme de croissance des vagues dans le modèle d'Eliot Bismuth est tiré des notes de Fabrice Ardhuin \autocite{Ardhuin2024ocean}, qui sont elle aussi tirées d'un article de \Textcite{snyder1981array}.
Essentiellement, on assume que la croissance des vagues dans le terme source prend la forme
\begin{equation}
   S_{in}(f,\theta) = \sigma \beta E(f,\theta). 
\end{equation}
Dans l'équation précédente, le facteur \(\beta\) est un taux de croissance adimensionnel.
Généralement, on utilise une fonction obtenue de manière empirique.
Par contre, \Textcite{snyder1981array} ont réussi à la mettre en équation, soit
\begin{equation}
   \beta = \max \qty{0,\pt0.25\frac{\rho_a}{\rho_o} \qty[28\frac{u_\star}{C} \cos(\theta_\star - \theta) - 1]}.
\end{equation}
En 1 dimension, ça se traduirait par
\begin{equation}
   \boxed{\venti\quad\beta = \max \qty{0,\pt0.25\frac{\rho_a}{\rho_o} \qty[28\frac{u_\star}{C} - 1]},\quad}
\end{equation}
et c'est bien ce qu'on a! Par contre, je n'ai pas vu le \emph{max} dans le code de Bismuth\ldots{}
\subsection{Pierson-Moskowitz}
\label{sec:orgaccf29c}

Y'a quelque chose de louche dans la maîtrise de Bismuth, c'est vraiment pas clair si les fréquences utilisées sont en \(\mathrm{s}^{-1}\) ou en \(\mathrm{Rad}\cdot\mathrm{s}^{-1}\).
Particulièrement où il y a la ligne de Pierson-Moscowitz.
C'est pourquoi je suis allé le chercher à la source, le \emph{JONSWAP final report} \autocite{hasselmann1973measurements}.
Donc Pierson-Moskowitz, c'est
\begin{equation}
   E_{PM}(f) = \alpha g^2 (2\pi)^4 f^{-5} \exp[- \frac{5}{4} \qty(\frac{f}{f_m})^{-4}],
\end{equation}
mais si on prend le spectre JONSWAP, on multiplie par une composante qu'on appelle le \emph{peak enhancement factor} \(\left(\pt\gamma^{g(f,\sigma)}\pt\right)\),
\begin{align}
   && E_{JONSWAP}(f) = E_{PM}(f)\times\gamma^{g(f,\sigma)}
   && \text{de sorte que} 
   && g(f,\sigma) = \exp[ \frac{-(f-f_m)^2}{2\sigma^2f_m^2}], &&
\end{align}
ce qui nous laisse 5 paramètres flottant, soient \(f_m, \alpha, \gamma, \sigma_a, \sigma_b\).
Où l'on relit les derniers facteurs à l'aide de
\begin{equation}
   \sigma = \left\lbrace\begin{matrix}
       \sigma_a & \mathrm{si} & f \leq f_m,\\
       \sigma_b & \mathrm{si} & f > f_m.\\
   \end{matrix}
  \right.
\end{equation}

Par contre, Bismuth prend plutôt la formulation
\begin{equation}
   E_{JONSWAP}(\omega) = 0.2H_s^2 \qty(\frac{\omega_p^4}{\omega^5}) \exp{-\frac{5}{4}\qty(\frac{\omega_p}{\omega})^4} \times 3.3^{\exp{\frac{-(\omega-\omega_p)^2}{2\sigma^2 \omega_p^2}}}.
\end{equation}

Selon \Textcite{hasselmann1973measurements}, on devrait avoir les valeurs
\begin{align}
   &&\gamma = 3.3, && \sigma_a = 0.7, && \sigma_b = 0.9, &&
\end{align}
à l'équilibre -- c'est d'ailleur ce que Bismuth a mis.\bigskip

Donc, l'erreur vient du fait que dans son manuscrit, tout est en \(\mathrm{Rad}\cdot\mathrm{s}^{-1}\) quand tout devrait être en \(\mathrm{s}^{-1}\), ce qui se traduit par l'équation 2.15 de la maîtrise de Bismuth, soit
\begin{equation}
   E_{JONSWAP}(f) = 0.2\qty(\venti\frac{H_s^2}{2\pi}) \qty(\frac{f^4_p}{f^5}) \exp{-\frac{5}{4}\qty(\frac{f_p}{f})^4} \times 3.3^{\exp{\frac{-(\omega-\omega_p)^2}{2\sigma^2 \omega_p^2}}}.
\end{equation}
C'est une faute d'inattention. Dans les faits, il aurait du avoir
\begin{equation}
   \boxed{E_{JONSWAP}(f) = 0.2 \venti H_s^2 \qty(\frac{f^4_p}{f^5}) \exp{-\frac{5}{4}\qty(\frac{f_p}{f})^4} \times 3.3^{\exp{\frac{-(\omega-\omega_p)^2}{2\sigma^2 \omega_p^2}}}.}
\end{equation}
D'ailleurs, il ne cite pas que sa formulation vient de \Textcite{goda1988variablity}.
On en fait justement mention sur \href{https://wikiwaves.org/Ocean-Wave\_Spectra}{l'article de Wikiwaves sur le JONSWAP} en mentionnant qu'il faut faire attention à la conversion.
\subsection{Retour sur la méthode de Lax-Wendroff}
\label{sec:org60cc8dc}

Malheureusement, si l'on veut un \emph{Superbee flux limiter}, on doit recoder la méthode de Lax-Wendroff.
En théorie, le limituer s'applique sur une quantité qu'on appelle le \emph{flux}.
Cette quantité, c'est en fait ce qui sort d'un cube (ou d'un carré dans notre cas).\bigskip

On n'oublie pas qu'il faut résoudre
\begin{align}
   &&\pdv{E}{t} + c_g \pdv{E}{x} = 0 && \Longrightarrow &&   \pdv{E}{t} + \pdv{F(E)}{x}  = 0 \quad\text{où}\quad F(E) = c_gE &&
\end{align}

Grossièrement, on peut solutionner cette équation en additionnant un \(\var{F}\), qui est en fait le \emph{flux} de notre fonction.
C'est justement ce que nous allons limiter dans 
\begin{equation}
   E_i^{n+1} = E_i^n - \qty(\frac{\var{t}}{\var{x}})\qty[\tall\ F_{i+\sfrac{1}{2}} - F_{i-\sfrac{1}{2}}\ ],
\end{equation}
Dans le cas de Lax-Wendroff, on peut représenter les flux sur chaque bords comme
\begin{subequations}
\begin{align}
   &F_{i-\sfrac{1}{2}} = \frac{1}{2}\qty(E_i^n - E_{i-1}^n) - \phi(E_{i-\sfrac{1}{2}}) \times\frac{1}{2}\fdv{t}{x}\qty(F(E_i^n) - F(E_{i-1}^n)),\\
   &F_{i+\sfrac{1}{2}} = \underbrace{\venti\frac{1}{2}\qty(E_{i+1}^n - E_i^n)}_{\mathrm{Moyenne}} - \ \phi(E_{i+\sfrac{1}{2}}) \times\underbrace{\venti\frac{1}{2}\fdv{t}{x}\qty(F(E_{i+1}^n) - F(E_i^n)).}_{\mathrm{Variation}}
\end{align}
\end{subequations}
où \(\phi\) est le limiteur.
Dans le cas qui nous intéresse (\href{https://en.wikipedia.org/wiki/Flux\_limiter}{limiteur \emph{superbee}})  -- car il existe toutes sortes de limiteurs -- nous avons

\begin{align}
   && && &&r_{i+\sfrac{1}{2}} = \qty(\frac{E_i - E_{i-1}}{E_{i+1} - E_i}),    && r_{i-\sfrac{1}{2}} = \qty(\frac{E_{i-1} - E_{i-2}}{E_{i} - E_{i-1}}) && &&
\end{align}
où le limiteur est exprimé par
\begin{equation}
   \phi = \mathrm{max} \qty{\begin{matrix}
       \pt\mathrm{min}(1, 2r)\\
       \mathrm{min}(2,\ r)\\
   \end{matrix}
   }.
\end{equation}

Voilà. Il faudra implémenter ça, plutôt que ma fonction d'algèbre linéaire, malheureusement.
C'est fait, en tout cas!
\section{Coefficient d'atténuation}
\label{sec:orge769e47}

Dany mentionnait l'article de \Textcite{auclair2022model} qui offre un coefficient d'atténuation qui avait été proposé par \Textcite{sutherland2019two}.
\subsection{Article de \Textcite{auclair2022model}}
\label{sec:orgd2a6075}


\subsubsection{Atténuation des vagues par la glace}
\label{sec:orgc36c9b6}
Grossièrement, on s'éloigne de la méthode de \Textcite{Kohout2011wave}, ce qui est une bonne nouvelle.
L'article de \Textcite{sutherland2019two} semble empiriquement meilleur pour obtenir un coefficient d'atténuation physique \(\alpha\ [\mathrm{m}^{-1}]\).
Dans l'article, on illustre le terme source de l'atténuation par la glace par
\begin{equation}
   S_{ice} = - \beta(A,h,f)\pt E_{waves}.
\end{equation}
Le coefficient d'atténuation temporel \(\beta\ [\mathrm{s}^{-1}]\) est donné par 
\begin{equation}
   \beta = \frac{\nu \omega^2 \Delta_0}{2g\epsilon h},
\end{equation}
où
\begin{equation}
   \nu = \frac{1}{2} \epsilon^2 \omega h^2,
\end{equation}
est l'épaisseur relative d'une couche perméable de glace recouvrant notre eau et \(\Delta_0\) est un paramètre relié à l'amplitude du mouvement des vagues à l'intérieur de cette même couche.
Il est donc suggéré de mettre ensemble ces deux équations pour ovtenir,
\begin{equation}
   \beta = \frac{\epsilon \Delta_0 h \omega^3}{4g}.
\end{equation}
Les deux paramètres libres \(\epsilon\) et \(\Delta_0\) peuvent être combinés.
Selon les données de \Textcite{sutherland2019two}, on devrait avoir une relation empirique du genre
\begin{equation}
   \epsilon \Delta_0 = 0.5.
\end{equation}

Mentionnons qu'on peut aussi obtenir le taux d'atténuation par floe \(a\) -- comme utilisé par \Textcite{Kohout2011wave} -- et le mettre en relation avec le taux d'atténuation physique par distance \(\alpha\). 
La relation est donnée par
\begin{equation}
   \alpha = \frac{A a}{D},
\end{equation}
où \(D\) est le diamètre du floe et \(A\) est la concentration de glace.
\section{Recherche d'une métrique sur l'hétérogénéité des paquets de glace}
\label{sec:org2423729}

On pourrait commencer à regarder du côté de l'entropie.
CLairement, il faudrait voir si on peut relier une \emph{mesure du désordre} avec l'atténuation d'énergie dans un domaine de glace.

Mais comment représenter une mesure du désordre?











\printbibliography
\end{document}
